Запросы.ПростоКоннектор/src/DataProcessors/Коннектор_ВыборИсточника/Коннектор_ВыборИсточника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Коннектор_ВыборИсточника</name>
  <attributes>
    <name>ТаблицаПравилВыгрузки</name>
    <type>
      <types>ValueTree</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяРегистрация</name>
    <comment>Таблица дополнительной регистрации</comment>
    <type>
      <types>ValueTable</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияФормата</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РасширениеФормата</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантВыгрузки</name>
    <type>
      <types>EnumRef.ВариантыВыгрузки</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

Запросы.ПростоКоннектор/src/DataProcessors/Коннектор_ВыборИсточника/Forms/ФормаПодбораИсточника/Module.bsl
#Область ОбработчикиСобытийФормы

 &НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	Объект.ВерсияФормата = Параметры.ВерсияФормата;
	Объект.РасширениеФормата = Параметры.РасширениеФормата;
	Объект.ВариантВыгрузки = Параметры.ВариантВыгрузки;
	
	ОбновитьПравилаВыгрузкиНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаПравилВыгрузки

&НаКлиенте
Процедура ТаблицаПравилВыгрузкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;  
	
	Если Элементы.ТаблицаПравилВыгрузки.ТекущиеДанные <> Неопределено Тогда
	    ОповеститьОВыборе(Элементы.ТаблицаПравилВыгрузки.ТекущиеДанные.ПолноеИмяМетаданных);    
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьПравилаВыгрузкиНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЗаполнениеПравилВыгрузки();
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект"); 
	
КонецПроцедуры

#КонецОбласти
